# CutterFailures Properties

---
The BuiltInFailuresCutterFailures type exposes the following members.
| Name| Description
---|---|---
| MakeCutterForPlanRegionsGStepFailed|  Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.
| MakeCutterForSectionGStepFailed|  Attempt to create or manipulate a segmented section has failed.
Top
#### Reference
BuiltInFailuresCutterFailures Class
Autodesk.Revit.DB Namespace